export const workoutTypes = [
    { value: "가슴", label: "가슴" },
    { value: "등", label: "등" },
    { value: "어깨", label: "어깨" },
    { value: "팔", label: "팔" },
    { value: "하체", label: "하체" },
    { value: "복근", label: "복근" },
];

export const exerciseOptions = {
    가슴: [
        "인클라인 덤벨 프레스",
        "인클라인 벤치 프레스",
        "체스트 프레스",
        "펙 덱 플라이",
        "딥스",
        "덤벨 플라이",
        "케이블 크로스 오버",
    ],
    등: [
        "렛 풀 다운",
        "시티드 로우",
        "풀업",
        "암 풀 다운",
        "T바 로우",
        "데드리프트",
        "원 암 덤벨 로우",
        "시티드 로우",
    ],
    어깨: [
        "숄더프레스",
        "사이드 래터럴 레이즈",
        "프론트 프레스",
        "벤트 오버 레이즈",
        "업라이트 로우",
        "슈러그",
    ],
    팔: [
        "스탠딩 바벨 컬",
        "케이블 푸시 다운",
        "원암 덤벨 오버헤드 익스텐션",
        "스탠딩 트라이셉스 익스텐션",
    ],
    하체: [
        "스쿼트",
        "레그 익스텐션",
        "레그 컬",
        "카프 레이즈",
        "레그 프레스",
        "런지",
    ],
    복근: ["크런치", "레그 레이즈", "싯업"],
};
